//;******************************************************************************
//;* Copyright (c) 1983-2015, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//;
//; Module Name:
//;
//;   Strings.uni
//;
//; Abstract:
//;
//;   String definitions for HddPassword
//;

/=#

#langdef en-US "English"
#langdef fr-FR "Français"
//#langdef chn "\wide中文"
//#langdef jpn "\wide日本語\narrow"
//#langdef ita "Italian"
//#langdef spa "Spanish"
//#langdef ger "German"
//#langdef por "Portuguese"


#string STR_SATA                        #language en-US        "SATA Port"
                                        #language fr-FR        "SATA port"                                        
#string STR_NVME                        #language en-US        "NVMe              "
                                        #language fr-FR        "NVMe              "
#string STR_EMMC                        #language en-US        "eMMC              "
                                        #language fr-FR        "eMMC              "                                                                                
#string STR_HDD_PSW_LOCK                #language en-US        "  Lock    "
                                        #language fr-FR        "  Fermer   "
#string STR_HDD_PSW_UNLOCK              #language en-US        "  Unlock  "
                                        #language fr-FR        "  Unfermer  "
#string STR_HDD_ESC_SKIP_MSG            #language en-US        "Press [ESC] Abort Harddisk Security"
                                        #language fr-FR        "Press [ESC] Abort Harddisk Security"
#string STR_HDD_TITLE_MSG               #language en-US        "Harddisk Security"
                                        #language fr-FR        "Harddisk Security"
#string STR_HDD_DIALOG_THREE_ERRORS     #language en-US        "Enter incorrect password 3 times"
                                        #language fr-FR        "Enter incorrect password 3 times"
#string STR_HDD_DIALOG_CONTINUE_MSG     #language en-US        "Please press Enter to continue"
                                        #language fr-FR        "Please press Enter to continue"
#string STR_HDD_DIALOG_ENTER_MSG        #language en-US        "[ENTER]"
                                        #language fr-FR        "[ENTER]"
#string STR_HDD_DIALOG_ERROR_STATUS     #language en-US        "Error Status"
                                        #language fr-FR        "Error Status"
#string STR_HDD_ENTER_MANY_ERRORS       #language en-US        "Enter incorrect password too many times"
                                        #language fr-FR        "Enter incorrect password too many times"
#string STR_SECURITY_COUNT_EXPIRED      #language en-US        "HDD Security count expired bit is acted"
                                        #language fr-FR        "HDD Security count expired bit is acted"
#string STR_HDD_DIALOG_COLDBOOT_MSG     #language en-US        "Please shutdown the system"
                                        #language fr-FR        "Please shutdown the system"
#string STR_HDD_DIALOG_HELP_TITLE       #language en-US        "Please input password for "
                                        #language fr-FR        "Please input password for "


                                        